handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/inc/n32g05x_led.h
    /* LED Trim Value */
    uint8_t Trim_Rset;					/* LED Rset trim. */

    uint8_t Trim_BG;						/* LED BG trim. */
                                    
    uint8_t Trim_SEG[6];				/* LED SEGx trim. */
		/* *************** */
} LED_InitType;

/*LED GCLK_LowLevelNum*/
#define	GCLK_LOWLEVELNUM_2	((uint8_t)	2U)
#define	GCLK_LOWLEVELNUM_3	((uint8_t)	3U)
#define	GCLK_LOWLEVELNUM_4	((uint8_t)	4U)
#define	GCLK_LOWLEVELNUM_5	((uint8_t)	5U)
#define	GCLK_LOWLEVELNUM_6	((uint8_t)	6U)
#define	GCLK_LOWLEVELNUM_7	((uint8_t)	7U)
#define	GCLK_LOWLEVELNUM_8	((uint8_t)	8U)
#define	GCLK_LOWLEVELNUM_9	((uint8_t)	9U)
#define	GCLK_LOWLEVELNUM_10	((uint8_t)	10U)
#define	GCLK_LOWLEVELNUM_11	((uint8_t)	11U)
#define	GCLK_LOWLEVELNUM_12	((uint8_t)	12U)
#define	GCLK_LOWLEVELNUM_13	((uint8_t)	13U)
#define	GCLK_LOWLEVELNUM_14	((uint8_t)	14U)
#define	GCLK_LOWLEVELNUM_15	((uint8_t)	15U)
#define	GCLK_LOWLEVELNUM_16	((uint8_t)	16U)
#define	GCLK_LOWLEVELNUM_17	((uint8_t)	17U)
#define	GCLK_LOWLEVELNUM_18	((uint8_t)	18U)
#define	GCLK_LOWLEVELNUM_19	((uint8_t)	19U)
#define	GCLK_LOWLEVELNUM_20	((uint8_t)	20U)
#define	GCLK_LOWLEVELNUM_21	((uint8_t)	21U)
#define	GCLK_LOWLEVELNUM_22	((uint8_t)	22U)
#define	GCLK_LOWLEVELNUM_23	((uint8_t)	23U)
#define	GCLK_LOWLEVELNUM_24	((uint8_t)	24U)
#define	GCLK_LOWLEVELNUM_25	((uint8_t)	25U)
#define	GCLK_LOWLEVELNUM_26	((uint8_t)	26U)
#define	GCLK_LOWLEVELNUM_27	((uint8_t)	27U)
#define	GCLK_LOWLEVELNUM_28	((uint8_t)	28U)
#define	GCLK_LOWLEVELNUM_29	((uint8_t)	29U)
#define	GCLK_LOWLEVELNUM_30	((uint8_t)	30U)
#define	GCLK_LOWLEVELNUM_31	((uint8_t)	31U)
#define	GCLK_LOWLEVELNUM_32	((uint8_t)	32U)
#define	GCLK_LOWLEVELNUM_33	((uint8_t)	33U)
#define	GCLK_LOWLEVELNUM_34	((uint8_t)	34U)
#define	GCLK_LOWLEVELNUM_35	((uint8_t)	35U)
#define	GCLK_LOWLEVELNUM_36	((uint8_t)	36U)
#define	GCLK_LOWLEVELNUM_37	((uint8_t)	37U)
#define	GCLK_LOWLEVELNUM_38	((uint8_t)	38U)
#define	GCLK_LOWLEVELNUM_39	((uint8_t)	39U)
#define	GCLK_LOWLEVELNUM_40	((uint8_t)	40U)
#define	GCLK_LOWLEVELNUM_41	((uint8_t)	41U)
#define	GCLK_LOWLEVELNUM_42	((uint8_t)	42U)
#define	GCLK_LOWLEVELNUM_43	((uint8_t)	43U)
#define	GCLK_LOWLEVELNUM_44	((uint8_t)	44U)
#define	GCLK_LOWLEVELNUM_45	((uint8_t)	45U)
#define	GCLK_LOWLEVELNUM_46	((uint8_t)	46U)
#define	GCLK_LOWLEVELNUM_47	((uint8_t)	47U)
#define	GCLK_LOWLEVELNUM_48	((uint8_t)	48U)
#define	GCLK_LOWLEVELNUM_49	((uint8_t)	49U)
#define	GCLK_LOWLEVELNUM_50	((uint8_t)	50U)
#define	GCLK_LOWLEVELNUM_51	((uint8_t)	51U)
#define	GCLK_LOWLEVELNUM_52	((uint8_t)	52U)
#define	GCLK_LOWLEVELNUM_53	((uint8_t)	53U)
#define	GCLK_LOWLEVELNUM_54	((uint8_t)	54U)
#define	GCLK_LOWLEVELNUM_55	((uint8_t)	55U)
#define	GCLK_LOWLEVELNUM_56	((uint8_t)	56U)
#define	GCLK_LOWLEVELNUM_57	((uint8_t)	57U)
#define	GCLK_LOWLEVELNUM_58	((uint8_t)	58U)
#define	GCLK_LOWLEVELNUM_59	((uint8_t)	59U)
#define	GCLK_LOWLEVELNUM_60	((uint8_t)	60U)
#define	GCLK_LOWLEVELNUM_61	((uint8_t)	61U)
#define	GCLK_LOWLEVELNUM_62	((uint8_t)	62U)
#define	GCLK_LOWLEVELNUM_63	((uint8_t)	63U)
#define	GCLK_LOWLEVELNUM_64	((uint8_t)	64U)
#define	GCLK_LOWLEVELNUM_65	((uint8_t)	65U)
#define	GCLK_LOWLEVELNUM_66	((uint8_t)	66U)
#define	GCLK_LOWLEVELNUM_67	((uint8_t)	67U)
#define	GCLK_LOWLEVELNUM_68	((uint8_t)	68U)
#define	GCLK_LOWLEVELNUM_69	((uint8_t)	69U)
#define	GCLK_LOWLEVELNUM_70	((uint8_t)	70U)
#define	GCLK_LOWLEVELNUM_71	((uint8_t)	71U)
#define	GCLK_LOWLEVELNUM_72	((uint8_t)	72U)
#define	GCLK_LOWLEVELNUM_73	((uint8_t)	73U)
#define	GCLK_LOWLEVELNUM_74	((uint8_t)	74U)
#define	GCLK_LOWLEVELNUM_75	((uint8_t)	75U)
#define	GCLK_LOWLEVELNUM_76	((uint8_t)	76U)
#define	GCLK_LOWLEVELNUM_77	((uint8_t)	77U)
#define	GCLK_LOWLEVELNUM_78	((uint8_t)	78U)
#define	GCLK_LOWLEVELNUM_79	((uint8_t)	79U)
#define	GCLK_LOWLEVELNUM_80	((uint8_t)	80U)
#define	GCLK_LOWLEVELNUM_81	((uint8_t)	81U)
#define	GCLK_LOWLEVELNUM_82	((uint8_t)	82U)
#define	GCLK_LOWLEVELNUM_83	((uint8_t)	83U)
#define	GCLK_LOWLEVELNUM_84	((uint8_t)	84U)
#define	GCLK_LOWLEVELNUM_85	((uint8_t)	85U)
#define	GCLK_LOWLEVELNUM_86	((uint8_t)	86U)
#define	GCLK_LOWLEVELNUM_87	((uint8_t)	87U)
#define	GCLK_LOWLEVELNUM_88	((uint8_t)	88U)
#define	GCLK_LOWLEVELNUM_89	((uint8_t)	89U)
#define	GCLK_LOWLEVELNUM_90	((uint8_t)	90U)
#define	GCLK_LOWLEVELNUM_91	((uint8_t)	91U)
#define	GCLK_LOWLEVELNUM_92	((uint8_t)	92U)
#define	GCLK_LOWLEVELNUM_93	((uint8_t)	93U)
#define	GCLK_LOWLEVELNUM_94	((uint8_t)	94U)
#define	GCLK_LOWLEVELNUM_95	((uint8_t)	95U)
#define	GCLK_LOWLEVELNUM_96	((uint8_t)	96U)
#define	GCLK_LOWLEVELNUM_97	((uint8_t)	97U)
#define	GCLK_LOWLEVELNUM_98	((uint8_t)	98U)
#define	GCLK_LOWLEVELNUM_99	((uint8_t)	99U)
#define	GCLK_LOWLEVELNUM_100	((uint8_t)	100U)
#define	GCLK_LOWLEVELNUM_101	((uint8_t)	101U)
#define	GCLK_LOWLEVELNUM_102	((uint8_t)	102U)
#define	GCLK_LOWLEVELNUM_103	((uint8_t)	103U)
#define	GCLK_LOWLEVELNUM_104	((uint8_t)	104U)
#define	GCLK_LOWLEVELNUM_105	((uint8_t)	105U)
#define	GCLK_LOWLEVELNUM_106	((uint8_t)	106U)
#define	GCLK_LOWLEVELNUM_107	((uint8_t)	107U)
#define	GCLK_LOWLEVELNUM_108	((uint8_t)	108U)
#define	GCLK_LOWLEVELNUM_109	((uint8_t)	109U)
#define	GCLK_LOWLEVELNUM_110	((uint8_t)	110U)
#define	GCLK_LOWLEVELNUM_111	((uint8_t)	111U)
#define	GCLK_LOWLEVELNUM_112	((uint8_t)	112U)
#define	GCLK_LOWLEVELNUM_113	((uint8_t)	113U)
#define	GCLK_LOWLEVELNUM_114	((uint8_t)	114U)
#define	GCLK_LOWLEVELNUM_115	((uint8_t)	115U)
#define	GCLK_LOWLEVELNUM_116	((uint8_t)	116U)
#define	GCLK_LOWLEVELNUM_117	((uint8_t)	117U)
#define	GCLK_LOWLEVELNUM_118	((uint8_t)	118U)
#define	GCLK_LOWLEVELNUM_119	((uint8_t)	119U)
#define	GCLK_LOWLEVELNUM_120	((uint8_t)	120U)
#define	GCLK_LOWLEVELNUM_121	((uint8_t)	121U)
#define	GCLK_LOWLEVELNUM_122	((uint8_t)	122U)
#define	GCLK_LOWLEVELNUM_123	((uint8_t)	123U)
#define	GCLK_LOWLEVELNUM_124	((uint8_t)	124U)
#define	GCLK_LOWLEVELNUM_125	((uint8_t)	125U)
#define	GCLK_LOWLEVELNUM_126	((uint8_t)	126U)
#define	GCLK_LOWLEVELNUM_127	((uint8_t)	127U)
#define	GCLK_LOWLEVELNUM_128	((uint8_t)	128U)
#define	GCLK_LOWLEVELNUM_129	((uint8_t)	129U)
#define	GCLK_LOWLEVELNUM_130	((uint8_t)	130U)
#define	GCLK_LOWLEVELNUM_131	((uint8_t)	131U)
#define	GCLK_LOWLEVELNUM_132	((uint8_t)	132U)
#define	GCLK_LOWLEVELNUM_133	((uint8_t)	133U)
#define	GCLK_LOWLEVELNUM_134	((uint8_t)	134U)
#define	GCLK_LOWLEVELNUM_135	((uint8_t)	135U)
#define	GCLK_LOWLEVELNUM_136	((uint8_t)	136U)
#define	GCLK_LOWLEVELNUM_137	((uint8_t)	137U)
#define	GCLK_LOWLEVELNUM_138	((uint8_t)	138U)
#define	GCLK_LOWLEVELNUM_139	((uint8_t)	139U)
#define	GCLK_LOWLEVELNUM_140	((uint8_t)	140U)
#define	GCLK_LOWLEVELNUM_141	((uint8_t)	141U)
#define	GCLK_LOWLEVELNUM_142	((uint8_t)	142U)
#define	GCLK_LOWLEVELNUM_143	((uint8_t)	143U)
#define	GCLK_LOWLEVELNUM_144	((uint8_t)	144U)
#define	GCLK_LOWLEVELNUM_145	((uint8_t)	145U)
#define	GCLK_LOWLEVELNUM_146	((uint8_t)	146U)
#define	GCLK_LOWLEVELNUM_147	((uint8_t)	147U)
#define	GCLK_LOWLEVELNUM_148	((uint8_t)	148U)
#define	GCLK_LOWLEVELNUM_149	((uint8_t)	149U)
#define	GCLK_LOWLEVELNUM_150	((uint8_t)	150U)
#define	GCLK_LOWLEVELNUM_151	((uint8_t)	151U)
#define	GCLK_LOWLEVELNUM_152	((uint8_t)	152U)
#define	GCLK_LOWLEVELNUM_153	((uint8_t)	153U)
#define	GCLK_LOWLEVELNUM_154	((uint8_t)	154U)
#define	GCLK_LOWLEVELNUM_155	((uint8_t)	155U)
#define	GCLK_LOWLEVELNUM_156	((uint8_t)	156U)
#define	GCLK_LOWLEVELNUM_157	((uint8_t)	157U)
#define	GCLK_LOWLEVELNUM_158	((uint8_t)	158U)
#define	GCLK_LOWLEVELNUM_159	((uint8_t)	159U)
#define	GCLK_LOWLEVELNUM_160	((uint8_t)	160U)
#define	GCLK_LOWLEVELNUM_161	((uint8_t)	161U)
#define	GCLK_LOWLEVELNUM_162	((uint8_t)	162U)
#define	GCLK_LOWLEVELNUM_163	((uint8_t)	163U)
#define	GCLK_LOWLEVELNUM_164	((uint8_t)	164U)
#define	GCLK_LOWLEVELNUM_165	((uint8_t)	165U)
#define	GCLK_LOWLEVELNUM_166	((uint8_t)	166U)
#define	GCLK_LOWLEVELNUM_167	((uint8_t)	167U)
#define	GCLK_LOWLEVELNUM_168	((uint8_t)	168U)
#define	GCLK_LOWLEVELNUM_169	((uint8_t)	169U)
#define	GCLK_LOWLEVELNUM_170	((uint8_t)	170U)
#define	GCLK_LOWLEVELNUM_171	((uint8_t)	171U)
#define	GCLK_LOWLEVELNUM_172	((uint8_t)	172U)
#define	GCLK_LOWLEVELNUM_173	((uint8_t)	173U)
#define	GCLK_LOWLEVELNUM_174	((uint8_t)	174U)
#define	GCLK_LOWLEVELNUM_175	((uint8_t)	175U)
#define	GCLK_LOWLEVELNUM_176	((uint8_t)	176U)
#define	GCLK_LOWLEVELNUM_177	((uint8_t)	177U)
#define	GCLK_LOWLEVELNUM_178	((uint8_t)	178U)
#define	GCLK_LOWLEVELNUM_179	((uint8_t)	179U)
#define	GCLK_LOWLEVELNUM_180	((uint8_t)	180U)
#define	GCLK_LOWLEVELNUM_181	((uint8_t)	181U)
#define	GCLK_LOWLEVELNUM_182	((uint8_t)	182U)
#define	GCLK_LOWLEVELNUM_183	((uint8_t)	183U)
#define	GCLK_LOWLEVELNUM_184	((uint8_t)	184U)
#define	GCLK_LOWLEVELNUM_185	((uint8_t)	185U)
#define	GCLK_LOWLEVELNUM_186	((uint8_t)	186U)
#define	GCLK_LOWLEVELNUM_187	((uint8_t)	187U)
#define	GCLK_LOWLEVELNUM_188	((uint8_t)	188U)
#define	GCLK_LOWLEVELNUM_189	((uint8_t)	189U)
#define	GCLK_LOWLEVELNUM_190	((uint8_t)	190U)
#define	GCLK_LOWLEVELNUM_191	((uint8_t)	191U)
#define	GCLK_LOWLEVELNUM_192	((uint8_t)	192U)
#define	GCLK_LOWLEVELNUM_193	((uint8_t)	193U)
#define	GCLK_LOWLEVELNUM_194	((uint8_t)	194U)
#define	GCLK_LOWLEVELNUM_195	((uint8_t)	195U)
#define	GCLK_LOWLEVELNUM_196	((uint8_t)	196U)
#define	GCLK_LOWLEVELNUM_197	((uint8_t)	197U)
#define	GCLK_LOWLEVELNUM_198	((uint8_t)	198U)
#define	GCLK_LOWLEVELNUM_199	((uint8_t)	199U)
#define	GCLK_LOWLEVELNUM_200	((uint8_t)	200U)
#define	GCLK_LOWLEVELNUM_201	((uint8_t)	201U)
#define	GCLK_LOWLEVELNUM_202	((uint8_t)	202U)
#define	GCLK_LOWLEVELNUM_203	((uint8_t)	203U)
#define	GCLK_LOWLEVELNUM_204	((uint8_t)	204U)
#define	GCLK_LOWLEVELNUM_205	((uint8_t)	205U)
#define	GCLK_LOWLEVELNUM_206	((uint8_t)	206U)
#define	GCLK_LOWLEVELNUM_207	((uint8_t)	207U)
#define	GCLK_LOWLEVELNUM_208	((uint8_t)	208U)
#define	GCLK_LOWLEVELNUM_209	((uint8_t)	209U)
#define	GCLK_LOWLEVELNUM_210	((uint8_t)	210U)
#define	GCLK_LOWLEVELNUM_211	((uint8_t)	211U)
#define	GCLK_LOWLEVELNUM_212	((uint8_t)	212U)
#define	GCLK_LOWLEVELNUM_213	((uint8_t)	213U)
#define	GCLK_LOWLEVELNUM_214	((uint8_t)	214U)
#define	GCLK_LOWLEVELNUM_215	((uint8_t)	215U)
#define	GCLK_LOWLEVELNUM_216	((uint8_t)	216U)
#define	GCLK_LOWLEVELNUM_217	((uint8_t)	217U)
#define	GCLK_LOWLEVELNUM_218	((uint8_t)	218U)
#define	GCLK_LOWLEVELNUM_219	((uint8_t)	219U)
#define	GCLK_LOWLEVELNUM_220	((uint8_t)	220U)
#define	GCLK_LOWLEVELNUM_221	((uint8_t)	221U)
#define	GCLK_LOWLEVELNUM_222	((uint8_t)	222U)
#define	GCLK_LOWLEVELNUM_223	((uint8_t)	223U)
#define	GCLK_LOWLEVELNUM_224	((uint8_t)	224U)
#define	GCLK_LOWLEVELNUM_225	((uint8_t)	225U)
#define	GCLK_LOWLEVELNUM_226	((uint8_t)	226U)
#define	GCLK_LOWLEVELNUM_227	((uint8_t)	227U)
#define	GCLK_LOWLEVELNUM_228	((uint8_t)	228U)
#define	GCLK_LOWLEVELNUM_229	((uint8_t)	229U)
#define	GCLK_LOWLEVELNUM_230	((uint8_t)	230U)
#define	GCLK_LOWLEVELNUM_231	((uint8_t)	231U)
#define	GCLK_LOWLEVELNUM_232	((uint8_t)	232U)
#define	GCLK_LOWLEVELNUM_233	((uint8_t)	233U)
#define	GCLK_LOWLEVELNUM_234	((uint8_t)	234U)
#define	GCLK_LOWLEVELNUM_235	((uint8_t)	235U)
#define	GCLK_LOWLEVELNUM_236	((uint8_t)	236U)
#define	GCLK_LOWLEVELNUM_237	((uint8_t)	237U)
#define	GCLK_LOWLEVELNUM_238	((uint8_t)	238U)
#define	GCLK_LOWLEVELNUM_239	((uint8_t)	239U)
#define	GCLK_LOWLEVELNUM_240	((uint8_t)	240U)
#define	GCLK_LOWLEVELNUM_241	((uint8_t)	241U)
#define	GCLK_LOWLEVELNUM_242	((uint8_t)	242U)
#define	GCLK_LOWLEVELNUM_243	((uint8_t)	243U)
#define	GCLK_LOWLEVELNUM_244	((uint8_t)	244U)
#define	GCLK_LOWLEVELNUM_245	((uint8_t)	245U)
#define	GCLK_LOWLEVELNUM_246	((uint8_t)	246U)
#define	GCLK_LOWLEVELNUM_247	((uint8_t)	247U)
#define	GCLK_LOWLEVELNUM_248	((uint8_t)	248U)
#define	GCLK_LOWLEVELNUM_249	((uint8_t)	249U)
#define	GCLK_LOWLEVELNUM_250	((uint8_t)	250U)
#define	GCLK_LOWLEVELNUM_251	((uint8_t)	251U)
#define	GCLK_LOWLEVELNUM_252	((uint8_t)	252U)
#define	GCLK_LOWLEVELNUM_253	((uint8_t)	253U)
#define	GCLK_LOWLEVELNUM_254	((uint8_t)	254U)
#define	GCLK_LOWLEVELNUM_255	((uint8_t)	255U)

/*LED COM_WorkNum*/
#define	LED_COM_WORKNUM_2	((uint8_t)	2U)
#define	LED_COM_WORKNUM_3	((uint8_t)	3U)
#define	LED_COM_WORKNUM_4	((uint8_t)	4U)
#define	LED_COM_WORKNUM_5	((uint8_t)	5U)
#define	LED_COM_WORKNUM_6	((uint8_t)	6U)
#define	LED_COM_WORKNUM_7	((uint8_t)	7U)
#define	LED_COM_WORKNUM_8	((uint8_t)	8U)
#define	LED_COM_WORKNUM_9	((uint8_t)	9U)
#define	LED_COM_WORKNUM_10	((uint8_t)	10U)


/*LED SEG_WorkCurrent*/
#define     LED_WORKCURRENT_5_MA          	 ((uint8_t) 0U)
#define     LED_WORKCURRENT_5_P5_MA          ((uint8_t) 1U)
#define     LED_WORKCURRENT_6_MA          	 ((uint8_t) 2U)
#define     LED_WORKCURRENT_6_P5_MA          ((uint8_t) 3U)
#define     LED_WORKCURRENT_7_MA          	 ((uint8_t) 4U)
#define     LED_WORKCURRENT_7_P5_MA          ((uint8_t) 5U)
#define     LED_WORKCURRENT_8_MA          	 ((uint8_t) 6U)
#define     LED_WORKCURRENT_8_P5_MA          ((uint8_t) 7U)
#define     LED_WORKCURRENT_9_MA          	 ((uint8_t) 8U)
#define     LED_WORKCURRENT_9_P5_MA          ((uint8_t) 9U)
#define     LED_WORKCURRENT_10_MA          	 ((uint8_t) 10U)
#define     LED_WORKCURRENT_10_P5_MA         ((uint8_t) 11U)
#define     LED_WORKCURRENT_11_MA          	 ((uint8_t) 12U)
#define     LED_WORKCURRENT_11_P5_MA         ((uint8_t) 13U)
#define     LED_WORKCURRENT_12_MA          	 ((uint8_t) 14U)
#define     LED_WORKCURRENT_12_P5_MA         ((uint8_t) 15U)
#define     LED_WORKCURRENT_13_MA          	 ((uint8_t) 16U)
#define     LED_WORKCURRENT_13_P5_MA         ((uint8_t) 17U)
#define     LED_WORKCURRENT_14_MA          	 ((uint8_t) 18U)
#define     LED_WORKCURRENT_14_P5_MA         ((uint8_t) 19U)
#define     LED_WORKCURRENT_15_MA          	 ((uint8_t) 20U)
#define     LED_WORKCURRENT_15_P5_MA         ((uint8_t) 21U)
#define     LED_WORKCURRENT_16_MA          	 ((uint8_t) 22U)
#define     LED_WORKCURRENT_16_P5_MA         ((uint8_t) 23U)
#define     LED_WORKCURRENT_17_MA          	 ((uint8_t) 24U)
#define     LED_WORKCURRENT_17_P5_MA         ((uint8_t) 25U)
#define     LED_WORKCURRENT_18_MA          	 ((uint8_t) 26U)
#define     LED_WORKCURRENT_18_P5_MA         ((uint8_t) 27U)
#define     LED_WORKCURRENT_19_MA          	 ((uint8_t) 28U)
#define     LED_WORKCURRENT_19_P5_MA         ((uint8_t) 29U)
#define     LED_WORKCURRENT_20_MA          	 ((uint8_t) 30U)

/*LED Scan_Mode*/
#define     LED_SCAN_MODE_8SEG_8SEG          ((uint8_t) 0U)
#define     LED_SCAN_MODE_16SEG              ((uint8_t) 1U)

/*LED Work_Mode*/
#define     LED_WORK_MODE_DISABLE             ((uint8_t) 0U)
#define     LED_WORK_MODE_ENABLE              ((uint8_t) 1U)

/*LED Cur_ScanCOM*/
#define     LED_CUR_SCANCOM_COM0              ((uint8_t) 0U)
#define     LED_CUR_SCANCOM_COM1              ((uint8_t) 1U)
#define     LED_CUR_SCANCOM_COM2              ((uint8_t) 2U)
#define     LED_CUR_SCANCOM_COM3              ((uint8_t) 3U)
#define     LED_CUR_SCANCOM_COM4              ((uint8_t) 4U)
#define     LED_CUR_SCANCOM_COM5              ((uint8_t) 5U)
#define     LED_CUR_SCANCOM_COM6              ((uint8_t) 6U)
#define     LED_CUR_SCANCOM_COM7              ((uint8_t) 7U)
#define     LED_CUR_SCANCOM_COM8              ((uint8_t) 8U)
#define     LED_CUR_SCANCOM_COM9              ((uint8_t) 9U)
#define     LED_CUR_SCANCOM_SHUTDOWM          ((uint8_t) 0x0FU)


