handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/inc/n32g05x_led.h
#define     PROTOCOL_HEAD_CMD                ((uint16_t)0x8000U )
#define     PROTOCOL_BASE_CMD                ((uint16_t)0x0000U )
#define     PROTOCOL_TRIM_CMD                ((uint16_t)0x1000U )
#define     PROTOCOL_GLOBAL_CMD              ((uint16_t)0x2000U )
#define     PROTOCOL_SEG_DUTY_CMD            ((uint16_t)0x3000U )

/*LED Base Command Definition*/
#define     LED_CMD_COM_FORCE_SHUTDOWM       ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0000U))
#define     LED_CMD_COM_SCAN_RESET           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0100U))
#define     LED_CMD_COM_SCAN_ON              ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0200U))
#define     LED_CMD_READ_REG                 ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0300U))
#define     LED_CMD_READ_OFF                 ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0400U))
#define     LED_CMD_CHIP_WAKEUP              ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_BASE_CMD | 0x0700U))

/*LED Triming Command Definition*/
#define     LED_CMD_SEG_TRIM_REG0_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0000U))
#define     LED_CMD_SEG_TRIM_REG1_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0100U))
#define     LED_CMD_SEG_TRIM_REG2_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0200U))
#define     LED_CMD_SEG_TRIM_REG3_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0300U))
#define     LED_CMD_SEG_TRIM_REG4_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0400U))
#define     LED_CMD_SEG_TRIM_REG5_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0500U))
#define     LED_CMD_RSET_TRIM_REG_WRITE      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0600U))
#define     LED_CMD_BG_TRIM_REG_WRITE        ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_TRIM_CMD | 0x0700U))

/*LED Global Command Definition*/
#define     LED_CMD_SEG_CUR_DISP_MODE_CHIP_EN      ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_GLOBAL_CMD | 0x0000U))
#define     LED_CMD_COM_NUM_COM0_1_WORK_STATUS     ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_GLOBAL_CMD | 0x0100U))
#define     LED_CMD_COM2_9_WORK_STATUS             ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_GLOBAL_CMD | 0x0200U))
#define     LED_CMD_SEG0_7_WORK_STATUS             ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_GLOBAL_CMD | 0x0300U))
#define     LED_CMD_SEG8_15_WORK_STATUS            ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_GLOBAL_CMD | 0x0400U))

/*LED Seg Duty Data Command Definition*/
#define     LED_CMD_SEG0_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0000U))
#define     LED_CMD_SEG1_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0100U))
#define     LED_CMD_SEG2_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0200U))
#define     LED_CMD_SEG3_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0300U))
#define     LED_CMD_SEG4_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0400U))
#define     LED_CMD_SEG5_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0500U))
#define     LED_CMD_SEG6_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0600U))
#define     LED_CMD_SEG7_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0700U))
#define     LED_CMD_SEG8_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0800U))
#define     LED_CMD_SEG9_DUTY_DATA           ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0900U))
#define     LED_CMD_SEG10_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0A00U))
#define     LED_CMD_SEG11_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0B00U))
#define     LED_CMD_SEG12_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0C00U))
#define     LED_CMD_SEG13_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0D00U))
#define     LED_CMD_SEG14_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0E00U))
#define     LED_CMD_SEG15_DUTY_DATA          ((uint16_t)(PROTOCOL_HEAD_CMD | PROTOCOL_SEG_DUTY_CMD | 0x0F00U))

/*LED GCLK Prescale Definition*/
#define     LED_GCLK_DIV1                    RCC_LEDCLK_DIV1   
#define     LED_GCLK_DIV32                   RCC_LEDCLK_DIV32   
#define     LED_GCLK_DIV40                   RCC_LEDCLK_DIV40   
#define     LED_GCLK_DIV50                   RCC_LEDCLK_DIV50   
#define     LED_GCLK_DIV64                   RCC_LEDCLK_DIV64   
#define     LED_GCLK_DIV80                   RCC_LEDCLK_DIV80   
#define     LED_GCLK_DIV160                  RCC_LEDCLK_DIV160   

/*LED GCLK clock source Definition*/
#define     LED_GCLK_SRC_HSI                 RCC_LEDCLK_SRC_HSI   
#define     LED_GCLK_SRC_HSE                 RCC_LEDCLK_SRC_HSE  

#define     SPI_DUMMY_DATA                   (0xFFFFU)


#define     MAX_LED_SEG_ID                   (0x10U)
#define     MAX_LED_SEG_DUTY                 (0x003FU)
/* this value must be fix at 130 */
#define     LED_CLOCK_CYCLE_NUMBER           (0x82U) 
/* GCLK_MNUM Close */
#define     LED_MCLOCK_CYCLE_0               (0xFFU)
/* GCLK_NNUM Close */ 
#define     LED_NCLOCK_CYCLE_0               (0x01U) 

#define     NVR_ADDR_90H_TRIM                (0x1FFFF938U) 
#define     NVR_ADDR_91H_TRIM                (0x1FFFF940U) 
#define     NVR_ADDR_92H_TRIM                (0x1FFFF948U) 
#define     NVR_ADDR_93H_TRIM                (0x1FFFF950U) 
#define     NVR_ADDR_94H_TRIM                (0x1FFFF958U) 
#define     NVR_ADDR_95H_TRIM                (0x1FFFF960U) 
#define     NVR_ADDR_96H_TRIM                (0x1FFFF968U) 
#define     NVR_ADDR_97H_TRIM                (0x1FFFF970U)

#define		GCLK_ENABLE							ENABLE
#define		GCLK_DISABLE						DISABLE
#define		GCLKDMA_ENABLE						ENABLE
#define		GCLKDMA_DISABLE						DISABLE

/*** LED Macro Definition End ***/
                                            
                                            

/*** LED Driving Functions Declaration ***/
void LED_TrimGet(LED_InitType *led_status_get);
void LED_TrimLoad(LED_InitType *led_status_set);
void LED_DeInit(void);
void LED_InitStruct(LED_InitType* LED_InitStruct);
void LED_Init(LED_InitType* LED_InitStruct);
void LED_SEG_DutyDataSet(uint8_t SegId, uint8_t duty);

ErrorStatus Get_LED_Scan_COM_Status(uint8_t COM_num, uint8_t *com_scan_list);
void LED_Get_Cur_ScanCOM_List(uint8_t COM_num, uint8_t index, uint8_t *com_scan_list);
ErrorStatus LED_Check_Cur_ScanCOM(uint8_t COM_num, uint8_t index);
void LED_Get_RegData(LED_InitType *led_status_get);
uint16_t SPI_SendDataToLED(uint16_t data) ;

void LED_GclkConfiguration(uint32_t LED_clksrc, uint32_t LED_prescaler);
void LED_SpiInit(void);
void LED_RccConfiguration(void);
void LED_GpioConfiguration(uint8_t COM_WorkNum, uint16_t SEG_WorkStatus);
                                            
#ifdef __cplusplus
}
#endif

#endif /* __N32G05X_LED_H__ */


